import discord

from func.config import img_


def story_one():
    embed = discord.Embed(
        title="บทที่ 1 ศึกเรือนจำ",
        description="ริคส์ ที่เข้ารักษาอาการบาดเจ็บสาหัสจากการปะทะกับคนร้าย ได้ตื่นจากอาการโคม่า และพบว่าทั่วทั้งโรงพยาบาลต่างเต็มไปด้วยศพของคนตาย เขาพยายามดิ้นรนเอาชีวิตรอด"
                    "เพื่อตามหาลูกและเมียจนในที่สุดได้สร้างเป็นกลุ่มผู้รอดชีวิตที่ได้ทำการยึดพื้นที่จากนักโทษในเรือนจำไว้ได้ ขณะเดียวกันผู้ว่าของเมืองวูดเบอรี รัฐจอร์เจีย"
                    " กำลังรวบรวมผู้คนเพื่อใช้เป็นเครื่องมือในการต่อสู้แย่งชิงอาหารและอาวุธจากที่ต่าง ๆ และศึกแห่งการแย่งชิงเรือนจำจึงประทุขึ้น",
        colour=discord.Colour.from_rgb(146, 43, 33)
    )

    embed.add_field(name="Event ศึกเรือนจำ",
                    value="ริกส์ และพวกพ้องต้องต่อสู้เพื่อต้านการโจมตี ของกลุ่มผู้ว่าซึ่งจะจัดตั้งขึ้นเป็นกลุ่มชั่วคราวสำหรับเข้าร่วมอีเว้นศึกเรือนจำ โดยทั้ง 2 กลุ่ม จะประกอบด้วยทีมผู้เล่นไม่เกินทีมละ 4 คน"
                          "อาวุธที่ใช้ในอีเว้นจะได้รับจากระบบ กลุ่มละ 4 กระบอก คือ ปืน M16 พร้อมเครื่องกระสุนกระบอกละ 3 ชุด ผู้เล่นที่ตายในอีเว้นให้ถือว่าตายไม่สามารถเข้าร่วมกิจกรรมต่อได้"
                    )

    embed.set_image(url=img_('story_one'))
    return embed