import discord
from discord.ext import commands, pages

from func.config import get_cooldown_time, img_


class StoryView(discord.ui.View):
    def __init__(self, bot):
        super(StoryView, self).__init__(timeout=None)
        self.bot = bot
        self.cooldown = commands.CooldownMapping.from_cooldown(1, int(get_cooldown_time()), commands.BucketType.member)
        self.story = [
            discord.Embed(
                title="📖 บทที่ 1 ช่วงเวลาที่แสนสุข",
                description="1 อาทิตย์ ก่อนโรคระบาดกระจาย ผู้คนบนเกาะยังดำเนินชีวิตไปอย่างปกติ ทรัยากรต่าง ๆ"
                            "มีมากมายเพียงพอต่อการอยู่อาศัย อารยธรรมของมนุษยชาติยังคงดำเนินไปตามปกติที่ควรจะเป็น แต่ทว่าความสงบสุขเหล่านั้นกำลังจะถูกทำลายในไม่ช้า",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 2 โรคระบาดครั้งใหญ่",
                description="2 อาทิตย์ให้หลัง โรคระบาดเริ่มกระจายไปทั่วทั้งเกาะ ผู้คนเริ่มแตกตื่นหนีตายออกนอกเมือง"
                            "และตามหาสถานที่ปลอดภัยสำหรับตน ในขณะเดียวกันก็มีกลุ่มคนบางกลุ่มที่กำลังรวบรวมผู้คนเพื่อผลประโยชน์อะไรบางอย่าง",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 3 คน",
                description="อาทิตย์ที่ 3 หลังจากโรคระบาดได้กระจายไปทั่วทั้งเกาะ อาหารและที่อยู่อาศัยเริ่มเป็นสิ่งที่จำเป็นต่อการดำรงชีวิตอย่างมาก"
                            " ผู้ค้นเริ่มแย่งชิงเสบียงของกันและกัน เกิดการปะทะปล้นฆ่าแย่งชิงอาวุธแย่งชิงพื้นที่เพื่อหวังที่จะได้ครอบครองไว้เพียงผู้เดียว",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 4 อาหาร",
                description="ผ่านไป 4 อาทิตย์หลังจากโรคระบาดได้คร่าชีวิตผู้คนไปเป็นจำนวนมาก และในขณะเดียวกันจำนวนซอมบี้ก็ได้เพิ่มขึ้นเรื่อยๆ การจะเข้าเมืองเพื่อไปหาเสบียง"
                            "ค่อนข้างยากรำบาก ทั้งเรื่องอาวุธที่มีอยู่น้อย และยานพาหนะที่ค่อย ๆพัง รวมทั้งน้ำมันก็เป็นสิ่งที่หาได้ยากขึ้น",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 5 อาวุธ",
                description="เข้าอาทิตย์ที่ 5 ผู้คนเริ่มปรับตัวกับการเปลี่ยนแปลงที่เกิดขึ้น บางกลุ่มรวมตัวกันและสร้างเป็นเมืองหรือหมู่บ้าน"
                            " และอยู่อาศัยร่วมกันอยากปกติสุข แต่ทว่ามีกลุ่มคนบางกลุ่มที่กำลังทำการเคลื่อนไหววางแผนอะไรบางอย่าง",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 6 นีแกน",
                description="The Savior กลุ่มคนที่แทนชื่อของตนเองว่า นีแกน ได้เริ่มกระจายตัวไปยังชุมชนต่าง ๆ เพื่อทำการผูกมิตรแลกกับ"
                            "การให้สัญญาว่าจะไม่ทำร้าย และจะช่วยเหลือเมื่อกลุ่มคนเหล่านั้นได้รับความเดือดร้อน เพียงแต่ชุมชนเหล่านั้น"
                            "ต้องส่งเสบียงบางส่วน หรือ 70% ของ อาหารและอาวุธที่ทางชุมชนเหล่านั้นมีให้กับกลุ่มของนีแกน",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 7 กดดัน",
                description="The Savior (นีแกน) ได้รับรู้ถึงภัยที่กำลังก่อตัวเพื่อต่อต้านอำนาจของตน จึงได้ส่งมือขวาไปยังเมือง Alexandria เพื่อทำการต่อรองอำนาจ"
                            "จนเกิดการปะทะกันเกิดขึ้นแต่ทว่า มิตรที่สัญญากันไว้ว่าจะร่วมช่วยเหลือกลับไม่ได้เป็นไปอย่างที่สัญญา",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 8 โต้กลับ",
                description="หลังจาก กลุ่มของนีแกนเข้าโจมตีเมือง Alexandria ริกส์และกลุ่มของตน จึงได้เริ่มรวมตัวกันอีกครั้งและรู้ว่าควรทำยังไงกับ นีแกน Alexandria จะล่มสลายหรือ"
                            "จะสามารถเอาชนะนีแกนได้",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 9 พันธมิตร",
                description="ฮิปท๊อป เมืองเล็ก ๆ ที่อยู่ใกล้เขตอากาศหน้า เริ่มขาดแคลนอาหาร อาวุธและผู้คน หลังจากที่โดนกลุ่มของนีแกนเข้าโจมตี ทำให้โครงสร้างของเขตรั้ว และตัวอาคารต่าง ๆ"
                            "พังเสียหาย พวกเขาต้องการความช่วยเหลือเร่งด่วนก่อนที่หน้าหนาวจะเข้ามาเยือน",
                colour=discord.Colour.from_rgb(85, 226, 32)
            ),
            discord.Embed(
                title="📖 บทที่ 10 Kingdom",
                description="kingdom เมืองขนาดใหญ่ที่ต้องตกอยู่ภายใต้การกำกับของนีแกน กษัตริย์เอซีเคียลถึงคราวที่ต้องรุกขึ้นสู้เพื่อประชาชนของตนเอง",
                colour=discord.Colour.from_rgb(85, 226, 32)
            )
        ]
        self.story[9].set_image(url=img_("kingdom"))
        self.story[9].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="ใช้การตั้งค่าเดิมจากอาทิตย์ก่อนหน้า")
        self.story[9].add_field(name="คำแนะนำ",
                                value="อาทิตย์นี้ เอซีเคียลจะเข้าต่อสู้กับกลุ่มของนีแกน โดยมี มอร์แกนเป็นตัวละครสำคัญ ผู้เล่น 1 คน จะได้รับบทเป็นมอร์แกน ซึ่งจะเป็นผู้เล่น Solo โดยมีหน้าที่จัดการกับ"
                                      "ผู้นำที่นำกองกำลังเข้ามาโจมตี เมือง Kingdom", inline=False)

        self.story[8].set_image(url=img_("Hilltop"))
        self.story[8].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="- การดรอปไอเท็มทุกชนิดจะถูกปิด หรือ เปิดให้เพียง 0.05%\n"
                                      "- เพิ่มจำนวนซอมบี้ และเพิ่มดาเมจ\n"
                                      "- เพิ่มภารกิจเพื่อจัดหายานพาหนะ หรือ อุปกรณ์ต่าง ๆ", inline=False)
        self.story[8].add_field(name="คำแนะนำ",
                                value="สถานการณ์ที่จะเกิดในเนื้อเรื่องบทที่ 9 จะเป็นการสร้างเหตุการณ์ การบุกโจมตีของกลุ่ม นีแกน เพื่อสั่งสอนให้ เมืองฮิลท๊อปได้รับรู้ถึง"
                                      " ความร้ายกาจของนีแกน หากไม่ยอมสวามิภักดิ์และส่งส่วยตามที่ได้ตกลงกัน เป็นอีเว้น กลุ่มนีแกน บุกโจมตีเมืองฮิลท็อป")

        self.story[7].set_image(url=img_("attrack"))
        self.story[7].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="ใช้การตั้งค่าคงเดิม และ ปรับจำนวนซอมบี้เพิ่มขึ้นเล็กน้อย เพื่อสร้างบรรยากาศปูทางสู่เนื้อเรื่อง อัลฟ่า")
        self.story[7].add_field(name="คำแนะนำ",
                                value="ผู้เล่นของกลุ่ม นีแกน ได้บุกไปยัง กลุ่มของกองขยะและจัดการฆ่าคนของกลุ่มกองขยะไปจนแทบไม่เหลือแต่ทว่ายังมีผู้รอดชีวิตเหลืออยู่"
                                      "ริกส์ ตัวแทนผู้เล่นจากกลุ่ม Alexandria ต้องเลือกว่าจะไปช่วยเหลือ หรือจะปล่อยให้กลุ่ม กองขยะถูกกำจัดจนหมดสิ้น", inline=False)

        self.story[6].set_image(url=img_("combine"))
        self.story[6].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="ใช้การตั้งค่าคงเดิม และ ปรับจำนวนซอมบี้เพิ่มขึ้นเล็กน้อย เพื่อสร้างบรรยากาศปูทางสู่เนื้อเรื่อง อัลฟ่า")
        self.story[6].add_field(name="คำแนะนำ",
                                value="ผู้เล่นของเมือง Alexandria จะต้องส่งตัวแทนไปยังกลุ่มกองขยะ (จัดตั้งขึ้นเฉพาะกิจ) เพื่อขอความช่วยเหลือในการส่ง"
                                      "คนเข้าช่วยต่อสู่กับกลุ่มของ นิแกนที่กำลังจะเข้าโจมตีเมือง Alexandria ซึ่งในเหตุการณ์ครั้งนี้ ผู้ที่เข้าร่วมกลุ่มของเมือง Alexandria"
                                      "หรือที่เรียกว่า กลุ่มกองขยะ อาจจะให้ความร่วมมือ หรือ หักหลังก็ได้", inline=False)


        self.story[5].set_image(url=img_("lucille"))
        self.story[5].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="ใช้การตั้งค่าคงเดิม\n"
                                      "- outpost ปรับแต่งให้ขายเพียงอุปกรณ์สำหรับคราฟสิ่งของ อาหารและเครื่องดื่ม\n"
                                      "- Outpost แต่ละที่จะรับซื้อและขายของแตกต่างกันออกไป\n"
                                      "- อาวุธ อุปกรณ์เสริม ชุดซ่อม และกระสุนมีขายเพียงบางชนิด\n"),
        self.story[5].add_field(name="คำแนะนำ",
                                value="ในสัปดาห์นี้จะเข้าสู่เนื้อเรื่องที่เกี่ยวข้องกับกลุ่มของ The Savior หรือที่รู้จักกันในนาม นีแกน ทั้งเซิร์ฟจะถูกกำหนดให้เข้าสู่โหมดเอาตัวรอด"
                                      "โดยการค่อย ๆ เริ่มมีการต่อต้าน เริ่มมีการต่อสู้กับกลุ่มของ นีแกนกับชุมชนต่าง ๆ โดยจะมีอีเว้นหลักคือ การตามหาปืน M82"
                                      " ที่ทาง กลุ่ม The Savior กำลังทำการขนย้ายหนี", inline=False)


        self.story[0].set_image(url=img_('story_intro'))
        self.story[0].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="- ปิดหุ่นยนต์ ปิดซอมบี้ระเบิด เปิดใช้งานแผนที่"
                                      "\n- ปิดการสร้างปาร์ตี้ ปิดการสร้างบ้าน"
                                      "\n- เรทดรอปตามพื้น 1% และกดค้นหา 0.5%"
                                      "\n- ดรอปยานพาหนะ 10 คัน"
                                      "\n- มีดาเมจเฉพาะจุดฟาร์มหลัก ๆ จำนวนซอมบี้ประปราย"
                                      "\n- outpost ปรับแต่งการตั้งค่า\n",
                                )
        self.story[0].add_field(name="คำแนะนำ",
                                value="วันแรกของการรันเซิร์ฟเวอร์ไปจนครบ 1 อาทิตย์"
                                      " ผู้เล่นต้องตามหากลุ่มคนของตนเพื่อรอสร้างปาร์ตี้ และก่อตั้งหมู่บ้าน พยายาม"
                                      "ระดมสรรพกำลังเพื่อจัดเตรียมและกักตุนอาหาร อาวุธและยานพาหนะต่าง ๆ"
                                      "การปะทะกันของผู้เล่นเป็นไปตามปกติ (ดาเมจจะเบากว่าปกติ เพื่อให้เกิดการต่อรอง)"
                                      "และมีอีเว้นระหว่างตำรวจและกลุ่มผู้ร้ายหลบหนี"
                                ,inline=False)

        self.story[1].set_image(url=img_('story_frist'))
        self.story[1].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="- ปิดหุ่นยนต์ ปิดซอมบี้ระเบิด ปิดใช้งานแผนที่ ปิดการสร้างบ้าน\n"
                                      "- เปิดให้สร้างปาร์ตี้ (รองรับสูงสุดที่ 7 คน)\n"
                                      "- เรทดรอปตามพื้นปรับลดลงเหลือ 0.5% กดค้นหาเหลือ 0.25%\n"
                                      "- outpost ปรับแต่งการตั้งค่า\n"
                                      "- เพิ่มจำนวนซอมบี้ตามเมือง (ไม่เยอะมากแต่เร่งการเกิดใหม่ให้เร็วขึ้น)\n"
                                      "- ซอมบี้ตามป่าจะน้อยหรือไม่เกิน 3 ตัว ซอมบี้ในบังเกอร์ ไม่เยอะมาก\n"
                                      "- เปิดดาเมจเพื่อสร้างโอกาสปะทะกันของกลุ่มคน (ดาเมจปกติ)"
                                )
        self.story[1].add_field(name="คำแนะนำ",
                                value="เข้าอาทิตย์ที่ 2 ช่วงเวลาแห่งการเอาชีวิตรอด โดยจะมี Event และภารกิจ ให้ผู้เล่นได้เข้าร่วมเพื่อเดินเนื้อเรื่อง"
                                      "จะเกิดการ ปะทะกันของกลุ่มคน มีภารกิจตามหาคนหรือกลุ่มคน มีภารกิจตามหาอาวุธที่ตกหล่นระหว่างหนีเอาชีวิตรอด"
                                      "จากฝูงซอมบี้ ภารกิจออกหาเสบียง และภารกิจช่วยเหลือ โดยทุกภารกิจและอีเว้น ผู้ชนะ ผู้ค้นพบหรือผู้ที่ทำภารกิจสำเร็จ"
                                      "จะได้รับ อาหารและอาวุธตามที่อีเว้นกำหนด"
                                , inline=False)

        self.story[2].set_image(url=img_("prisons"))
        self.story[2].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="- ปิดหุ่น ปิดซอมบี้ระเบิด ปิดใช้งานแผนที่ ปิดการสร้างบ้าน\n"
                                      "- เรดดรอปตามพื้น 0.25% กดค้นหา 0.1% outpost สินค้าเริ่มหมด\n"
                                      "- ซอมบี้เริ่มเยอะขึ้น ดาเมจปกติ (เร่งเวลาในการเกิดใหม่เร็วขึ้น)\n"
                                      "- ซอมบี้ตามป่าเพิ่มขึ้น ไม่ต่ำกว่า 10 ตัว (ดาเมจปกติ)\n"
                                      "- ซอมบี้ตามบ้านและบังเกอร์ (เร่งเวลาในการเกิดใหม่เร็วขึ้น)\n"
                                )
        self.story[2].add_field(name="คำแนะนำ",
                                value="อาทิตย์ที่ 3 หลังจากโรคระบาด ผู้คนเริ่มเกาะกลุ่ม ระดมสรรพกำลัง ออกสำรวจและเสาะหาเสบียง"
                                      "ตามเมืองและหมู่บ้านต่าง ๆ จนกระทั่งเกิดการปะทะกันของกลุ่มคนหลายกลุ่มหลายสถานที่ เซิร์ฟจะเปิดอีเว้นการ"
                                      "ปะทะกันของกลุ่มต่าง ๆ เพื่อแย่งชิงอาหารและอาวุธในจุดเมืองสำคัญ ๆ (ไม่มีการแจกอาวุธให้หาอาวุธกันมาเอง)"
                                      "ผู้ที่ชนะหรือกลุ่มที่ชนะจะได้รับอาหารและอาวุธตามจำนวนที่อีเว้นกำหนด", inline=False
                                )

        self.story[3].set_image(url=img_("farm"))
        self.story[3].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="- เปิดฟังก์ชั่นการสร้างสิ่งของ (บ้านและอื่น ๆ)\n"
                                      "- ยานพาหนะจะพังไวกว่าปกติ (มีดาเมจ)\n"
                                      "- จำนวนซอมบี้ตามป่า มากกว่าปกติ (ดาเมจมากกว่าปกติ)\n"
                                      "- จำนวนซอมบี้ตามหมู่บ้านและบังเกอร์ เพิ่มขึ้น\n"
                                      "- เรทดรอปตามพื้น 0.1% กดค้นหา 0.05% \n"
                                      "- ค่าอื่น ๆ ใช้ค่าคงเดิมของอาทิตย์ก่อน"
                                )
        self.story[3].add_field(name="คำแนะนำ",
                                value="อาทิตย์ที่ 4 ของการระบาดครั้งใหญ่ ผู้คนเริ่มสำรวจและรวมตัวกันก่อตั้งหมู่บ้าน เริ่มมีการทำการเกษตร เริ่มมีการแลกเปลี่ยนสินค้า"
                                      "ระหว่างเมือง หรือหมู่บ้าน แต่ทว่า การส่งสินค้าเพื่อทำการแลกเปลี่ยนของระหว่างเมืองนั้น เต็มไปด้วยอันตรายและความยากรำบาก"
                                , inline=False)

        self.story[4].set_image(url=img_("weapons"))
        self.story[4].add_field(name="การตั้งค่าเซิร์ฟ",
                                value="- มีดาเมจเฉพาะพื้นที่โซนอันตราย (วงสีแดง)\n"
                                      "- อัตราดรอปตามพื้น 0.1% กดค้นหา 0.05%\n"
                                      "- outpost แต่ละ sector จะรับซื้อสินค้าและขายสินค้าต่างกัน\n"
                                      "- ดาเมจปกติทั้งคน สัตว์ และสิ่งของ ซอมบี้ดาเมจเท่ากับ 2%\n"
                                      "- จำนวนซอมบี้เยอะขึ้นกว่าปกติ (เร่งการเกิดใหม่ไวขึ้น)\n"
                                )
        self.story[4].add_field(name="คำแนะนำ",
                                value="หลังจากผ่านไป 4 อาทิตย์และเข้าอาทิตย์ที่ 5 ทุกอย่างเริ่มเป็นปกติ กลุ่มคนหลายคนต้องประสบกับอันตรายหลากหลายรูปแบบ"
                                      " มีกลุ่มคนหลายคนที่ยังไม่เข้าใจและไม่เคยได้รับรู้ความจริงจากอันตรายของซอมบี้ แต่อีกไม่นานพวกเข้าทั้งหมดจะได้รับรู้ว่า"
                                      "ซอมบี้นั้นสุดแสนอันตราย (เตรียมตัวเข้าเนื้อเรื่อง อัลฟา) กลุ่มของผู้เล่นจะได้รับบททดสอบจากผู้แทรกซึมมากกับเหล่าฝูงซอมบี้"
                                ,inline=False)


    def get_story(self):
        return self.story

    @discord.ui.button(label="มินิสตอรี่ (The Walking Dead - Mini Story)", style=discord.ButtonStyle.secondary, emoji="📖", custom_id="read_story")
    async def read_story(self, button, interaction: discord.Interaction):
        button.disabled = False
        interaction.message.author = interaction.user
        bucket = self.cooldown.get_bucket(interaction.message)
        retry = bucket.update_rate_limit()
        if retry:
            return await interaction.response.send_message(
                f'อีก {round(retry, int(get_cooldown_time()))} วินาที คำสั่งถึงจะพร้อมใช้งานอีกครั้ง', ephemeral=True)

        await interaction.response.defer(ephemeral=True, invisible=False)

        try:
            pagelist = [
                pages.PaginatorButton(
                    "first", label="หน้าแรก", style=discord.ButtonStyle.secondary
                ),
                pages.PaginatorButton("prev", label="ก่อนหน้า", style=discord.ButtonStyle.secondary),
                pages.PaginatorButton(
                    "page_indicator", style=discord.ButtonStyle.gray, disabled=True
                ),
                pages.PaginatorButton("next", label="ถัดไป", style=discord.ButtonStyle.secondary),
                pages.PaginatorButton("last", label="หน้าสุดท้าย", style=discord.ButtonStyle.secondary),
            ]
            paginator = pages.Paginator(
                pages=self.get_story(),
                show_disabled=True,
                show_indicator=True,
                use_default_buttons=False,
                custom_buttons=pagelist,
                loop_pages=False,
            )
            await paginator.respond(interaction, ephemeral=True)
        except Exception as e:
            return await interaction.followup.send(e)
