def server_info():
    txt = "📖 Really Survival - SCUM Community Server\n" \
          "- เรทดรอปเท่ากับ 1% รีเซ็ตทุก 30 นาที ดรอปยานพาหนะตามค่าเริ่มต้น (รถทุกคันจะมีเครื่องยนต์)\n" \
          "- ปาร์ตี้สูงสุด 10 คน ต่อ 1 ธง (100 element per flag) ครอบครองยานพาหนะ 3 คัน\n" \
          "- กางวงทั่วแผนที่ป้องกันการขโมยและอันตรายจากผู้เล่น ไม่มีดาเมจบ้าน ไม่มีดาเมจระเบิด\n" \
          "- กางวงสำหรับอีเว้น และวงตามจุดฟาร์มใหญ่ ๆ ดาเมจตามค่าเริ่มต้นทุกประการ  \n" \
          "- outpost ปรับแต่งตามความเหมาะสมของอีเว้นต่าง ๆ ที่จะเกิดขึ้นภายในเซิร์ฟ\n" \
          "- ดาเมจซอมบี้เท่ากับค่าเริ่มต้น ไม่มีหุ่นยนตร์ และ ไม่มีโดรนเงิน\n" \
          "- ไม่มีแผนที่ กิจกรรมและภารกิจรออัพเดทในอนาคต" \
          ""
    return txt.strip()
def reg_info():
    txt = "📖 Register Information\n" \
          "- ผู้เล่นทุกคนต้องได้รับการ Verify จากระบบ จึงจะเข้าใช้งานเซิร์ฟเวอร์ได้ รูปแบบของเซิร์ฟเวอร์เป็น Roleplay 100% อิงตามเนื้อเรื่องของซีรี่ The Walking Dead " \
          "ไอเท็มทุกอย่างจะได้รับจากอีเว้นของเซิร์ฟเท่านั้น ไม่มีไอเท็มและยานพาหนะดรอป หรืออาจจะดรอปเพียง 0.1% เท่านั้น ดังนั้นควรตัดสินใจให้ดีก่อนลงทะเบียน"
    return txt.strip()