import discord
from func.config import img_


def extra_001():
    embed = discord.Embed(
        title="💊 ยา",
        description="กำหนดให้ส่งตัวแทนผู้เล่นของกลุ่มจำนวน 2 คน เข้าร่วมในเหตุการณ์ โดยเซิร์ฟจะจำลองเหตุการณ์ใน The Walking Dead SS2 โดยกำหนดให้ผู้เล่น"
                    "ตามหาอุปกรณ์เพื่อใช้รักษาเพื่อนร่วมทีมที่ได้รับบาดเจ็บ โดยจะจำลองสถานการณ์ขึ้นในตำแหน่งของโรงพยาบาล และเพิ่มเรื่องของการแย่งชิงเข้ามาเพื่อให้"
                    "โดยแต่ละทีมจะต้องแย่งชิงอุปกรณ์ทางการแพทย์กลับไปช่วยเพื่อนในทีม"
    )
    embed.set_image(url=img_("medicine"))
    return embed