import discord

from func.config import img_


def event_001():
    embed = discord.Embed(
        title="อีเว้นประจำสัปดาห์",
        description="1 สัปดาห์ต่อจากนี้ผู้เล่นทุกคนจะยังไม่ได้รับอนุญาตในการสร้างปาร์ตี้และสร้างบ้าน ผู้เล่นต้องรวมกลุ่มของตนให้ได้และร่วมกันกักตุนทรัพยากรต่าง ๆ"
                    "ให้พร้อมสำหรับเตรียมเข้าสู่เนื้อเรื่องหลัก โดยภายในสัปดาห์นี้จะมีอีเว้นเล็ก ดังนี้"
    )
    embed.add_field(
        name="อีเว้นไล่ล่าโจร",
        value="ไล่ล่าโจร จะใช้พื้นที่สะพานแห่งหนึ่งของเกาะใช้เป็นสถานที่สร้างอีเว้น โดยจะแบ่งเป็น 3 ทีม คือ ทีมของตำรวจ 2 ทีม และโจร 1 ทีม"
              "อีเว้นจะเป็นการขับรถไล่ล่าและจอดปะทะกันบนสะพาน สมมุติเหตุการณ์ ขณะกำลังขับรถหนีจากการไล่ล่าของทีมตำรวจทีมที่ 1 ระหว่างกำลังขับ"
              "รถจะข้ามสะพานรถของโจรเกิดเสียหลักและจอดติดอยู่กลางสะพาน ขณะเดียวกันปลายสะพานก็มีทีมของตำรวจทีมที่ 2 กำลังดักรออยู่ จึงเกิดการปะทะกัน"
              "เกิดขึ้น (โดยมีเงื่อนไขของอีเว้นดังนี้)")
    embed.add_field(
        name="เงื่อนไขและข้อตกลง",
        value="- ตำรวจทีมที่ 1 ต้องขับรถไล่ล่าและยิงสะกัดโดยการยิงที่ยางรถให้แตกจึงได้ถือว่าชนะ\n"
              "- ทีมโจรต้องพยายามขับรถหลบหนีเพื่อข้ามสะพานให้ได้ หากรถเกิดยางแตกขณะปะทะกับทีมตำรวจทีมที่ 1 ถือว่าแพ้ 1/2 ของอีเว้น\n"
              "- ทีมโจรหากผ่านทีมตำรวจทีมที่ 1 มาได้และรถไม่ได้รับความเสียหายถือว่าชนะ 1/2 ของอีเว้น\n"
              "- หากทีมโจรยางแตกต้องจอดปะทะกับทีมตำรวจทีมที่ 2 หากกระสุนจะหมดและโดนจับกุม ถือว่าแพ้\n"
              "- ทีมตำรวจที่ 2 ต้องสกัดจับทีมโจรให้ได้ หากทีมตำรวจทีมที่ 1 พลาดและรถของทีมโจรไม่ได้ยากแตกจนต้องจอดปะทะกลางสะพาน\n"
              "- หากทีมตำรวจที่ 2 ไม่สามารถสกัดจับทีมโจรได้ถือว่าแพ้\n", inline=False
    )
    embed.set_image(url=img_("event_frist"))
    return embed