import discord

from func.config import img_


def event_001():
    embed = discord.Embed(
        title="🚔 ตำรวจไล่ล่ากลุ่มโจร (นายอำเภอริกส์)",
        description="1 สัปดาห์ต่อจากนี้ผู้เล่นทุกคนจะยังไม่ได้รับอนุญาตในการสร้างปาร์ตี้และสร้างบ้าน ผู้เล่นต้องรวมกลุ่มของตนและร่วมกันกักตุนทรัพยากรต่าง ๆ"
                    " สำหรับเตรียมเข้าสู่เนื้อเรื่องหลัก โดยภายในสัปดาห์นี้จะมี Event เล็ก ๆ ซึ่งจะเป็นการปะทะของตำรวจและกลุ่มโจร โดย Event จะจัดขึ้นบริเวณสะพาน"
                    "ระหว่าง Z0 ไปยัง A0 โดยจะแบ่งกลุ่มออกเป็น ทีม ตำรวจไล่ล่า 1 ทีม กลุ่มโจร และ ทีมตำรวจที่ตั้งด่านสกัดรถของกลุ่มโจร"
    )
    embed.set_image(url=img_("event_frist"))
    return embed