import discord

from func.config import img_


def event_001():
    embed = discord.Embed(
        title="🚔 ล่ากลุ่มโจร",
        description="1 สัปดาห์ต่อจากนี้ผู้เล่นทุกคนจะยังไม่ได้รับอนุญาตในการสร้างปาร์ตี้และสร้างบ้าน ผู้เล่นต้องรวมกลุ่มของตนและร่วมกันกักตุนทรัพยากรต่าง ๆ"
                    " สำหรับเตรียมเข้าสู่เนื้อเรื่องหลัก โดยภายในสัปดาห์นี้จะมี Event เล็ก ๆ ซึ่งจะเป็นการปะทะของตำรวจและกลุ่มโจร โดย Event จะจัดขึ้นบริเวณสะพาน"
                    "ระหว่าง Z0 ไปยัง A0 โดยจะแบ่งกลุ่มออกเป็น ทีม ตำรวจไล่ล่า 1 ทีม กลุ่มโจร และ ทีมตำรวจที่ตั้งด่านสกัดรถของกลุ่มโจร"
    )
    embed.set_image(url=img_("event_frist"))
    return embed

def event_002():
    embed = discord.Embed(
        title="อาวุธปืนที่ทำหล่น",
        description="ในสัปดาห์ที่ 2 กำหนดให้ผู้เล่นส่งตัวแทนเพื่อเข้าร่วมอีเว้น ตามหาถุงปืนที่ ริกส์ทำหล่นไว้ ซึ่งภายในกระเป๋าจะประกอบด้วย อาวุธปืนลูกซองพร้อมกระสุน และกระสุน .45"
                    "จำนวนหนึ่ง โดยกำหนดพื้นที่จัดกิจกรรม เป็น เมือง D3 และพื้นที่เหล่านั้นจะเต็มไปด้วย ซอมบี้ อีเว้นนี้จะให้ผู้เล่นแบ่งเป็น 2 ทีม ต่อการดำเนินอีเว้น โดยประกอบด้วยทีมเจ้าของพื้นที่"
                    "และทีมของริกส์"
    )
    embed.set_image(url=img_("weapon_lose"))
    return embed